"I have read and agree to the WPS Office License Agreement and the Privacy Policy." = "我已阅读并同意WPS Office许可协议和隐私政策。";

"WPS Office License Agreement" = "WPS Office许可协议";

"Privacy Policy" = "隐私政策";

"Download failed, please check the network" = "下载失败，请检查网络";

"manual install" = "手动安装";

"Retry" = "重试";

"Install Now" = "立即安装";

"Installation failed, please check if the system has enough memory space." = "安装失败，请检查系统是否有足够的内存空间。";

"Installation failed, please close the running WPS Office." = "安装失败，请关闭正在运行的WPS Office。";

"Installing, please wait..." = "WPS Office下载中...";

"Language" = "语言";

"All-in-One OfficeSuite with PDFEditor. Now with AI" = "AI全能办公套件 · 支持专业PDF编辑";

"Cancel" = "取消";

"Tip" = "提示";

"Confirm" = "确认";

"In accordance with relevant policy requirements, for a better experience with WPS Office services, please read and agree to the License Agreement and Privacy Policy." = "根据相关政策要求，为了更好地使用 WPS Office服务，请阅读并同意许可协议和隐私政策。";

"License Agreement" = "许可协议";

"Create infinite possibilities" = "创造无限可能";

"Installing WPS Office" = "WPS Office安装中...";

"Before installing, please close the running WPS Office." = "安装前请关闭正在运行的 WPS Office。";